<?php

$mainValues = [
    'banned' => 'به دلیل تخلف حساب شما مسدود گردیده است در صورتی که اشتباه مسدود شده اید یا پشتیبانی تماس بگیرید....',
    'customer_custome_plan_day' => "⏳ لطفاً تعداد روزهای اشتراکتان را وارد کنید.\n💸 هزینه هر روز: DAY-PRICE تومان",
    'customer_custome_plan_volume' => "📊 لطفاً مقدار حجم سرویس خود را به گیگابایت وارد کنید.\n💰 هزینه هر گیگابایت: VOLUME-PRICE تومان",
    'customer_custome_plan_name' => "📝 لطفاً یک نام برای تنظیمات کانفیگ خود انتخاب کنید (فقط از حروف انگلیسی کوچک و اعداد بدون فاصله استفاده کنید).\nنمونه: ali123",
    'send_user_id' => "🔢 لطفاً آیدی عددی کاربر را ارسال کنید:",
    'enter_decrease_amount' => "💳 لطفاً مبلغی که می‌خواهید از حساب کاربر کم کنید را وارد نمایید:",
    'enter_increase_amount' => "💳 لطفاً مبلغی که می‌خواهید به حساب کاربر اضافه کنید را وارد نمایید:",
    'user_not_found' => "❗️ کاربری با این مشخصات پیدا نشد، لطفاً مجدداً بررسی کنید.",
    'amount_decreased_from_your_wallet' => "✅ مبلغ AMOUNT تومان از حساب شما کسر شد.",
    'amount_decreased_from_user_wallet' => "✅ مبلغ AMOUNT تومان از حساب کاربر مورد نظر کسر شد.",
    'increase_wallet_cart_to_cart' => "🔄 لطفاً یک تصویر از فیش واریزی برای ما ارسال کنید:

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ پس از تأیید، مبلغ به کیف پول شما اضافه می‌شود.",
    'order_increase_sent' => "🎉 سفارش شما با موفقیت ثبت شد. پس از تأیید، مبلغ به کیف پول شما اضافه می‌شود. 💖",
    'please_send_only_image' => "📷 لطفاً فقط تصویر ارسال کنید.",
    'reached_main_menu' => "🔙 برگشتیم به منوی اصلی! اگر کاری داری، بگو. 😉 یا یکی از گزینه‌ها رو انتخاب کن تا کمکت کنم.\n🚪 /start",
	
    'increase_wallet_request_message' => "💳 درخواست افزایش موجودی:

💰 مبلغ: PRICE تومان
👤 نام و نام خانوادگی: NAME
🎯 نام کاربری: @USERNAME
🎫 کد کاربری: <code>USER-ID</code>",

    'out_of_connection_capacity' => "⛔️ ظرفیت این اتصال تکمیل شده است.",
    'out_of_server_capacity' => "⛔️ ظرفیت این سرور تکمیل شده است.",
    'can_create_specific_account' => "روی این پلن فقط AMOUNT حساب می‌توانید ایجاد کنید.",
	'buy_account_cart_to_cart' => "🔄 لطفاً تصویر فیش واریزی یا شماره پیگیری، ساعت پرداخت و نام پرداخت کننده را در یک پیام ارسال کنید:

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ پس از تأیید، لینک سرور به صورت خودکار از طریق ربات ارسال می‌شود.",

    'renew_ccount_cart_to_cart' => "🔄 لطفاً تصویر فیش واریزی یا شماره پیگیری، ساعت پرداخت و نام پرداخت کننده را در یک پیام ارسال کنید:

🔰 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME",
    
    'order_buy_sent' => "🛍 سفارش شما با موفقیت ثبت شد. پس از تأیید، اطلاعات برای شما ارسال خواهد شد. 🎉",
	
    'buy_custom_account_request' => "💓 درخواست خرید پلن دلخواه ( TYPE )
    
▫️آیدی کاربر: USER-ID
👤 نام کاربر: <a href='tg://user?id=USER-ID'>NAME</a>
⚡️ نام کاربری: @USERNAME
💰 مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK
🔋 حجم سرویس: VOLUME گیگابایت
⏳ مدت سرویس: DAYS روز",

    'buy_new_account_request' => "❗️ خرید جدید ( TYPE )

▫️آیدی کاربر: USER-ID
👤 نام کاربر: NAME
⚡️ نام کاربری: @USERNAME
💰 مبلغ پرداختی: PRICE تومان
🚦 سرور: SERVERNAME
✏️ نام سرویس: REMARK
🔋 حجم سرویس: VOLUME گیگابایت
⏳ مدت سرویس: DAYS روز",

    'buy_new_much_account_request' => "❗️ خرید جدید ( TYPE )

▫️آیدی کاربر: USER-ID
👤 نام کاربر: NAME
⚡️ نام کاربری: @USERNAME
💰 مبلغ پرداختی: PRICE تومان
🏖 تعداد اکانت: ACCOUNT-COUNT
✏️ نام سرویس: REMARK",

    'invite_buy_new_account' => "👨‍👦‍👦 خرید ( زیرمجموعه )

🧝‍♂️ آیدی کاربر: USER-ID
🛡 نام کاربر: NAME
🔖 نام کاربری: @USERNAME
💰 مبلغ پرداختی: PRICE تومان
🔮 نام سرویس: REMARK
💮 سفارش: FILENAME",


    'renew_order_sent' => "✅ درخواست شما با موفقیت ثبت شد. پس از بررسی و تمدید، کانفیگ توسط ادمین ارسال خواهد شد. ممنون از صبوریت! 💖
    
🚪 /start",

    'renew_account_request_message' => "♻️ درخواست تمدید سرویس ( TYPE )

▫️آیدی کاربر: USER-ID
👤 نام کاربر: NAME
⚡️ نام کاربری: @USERNAME
💰 مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK
🔋 حجم سرویس: VOLUME گیگابایت
⏳ مدت سرویس: DAYS روز",

    'increase_account_request_message' => "⏰ درخواست افزایش ( TYPE سرویس )

▫️آیدی کاربر: USER-ID
👤 نام کاربر: NAME
⚡️ نام کاربری: @USERNAME
🎈 نام سرویس: REMARK
🔋 نوع افزایش: INCREASE گیگ/روز
💰 قیمت: PRICE تومان",

    'waiting_message' => "⏳ در حال انتظار ...",
    'join_channel_message' => "❌ برای استفاده از ربات، حتماً باید در کانال زیر عضو شوید:
    
✅ پس از عضویت، روی دکمه 'عضو شدم' کلیک کنید.",

    'bot_is_updating' => "🌛 ربات در حال به‌روزرسانی است،لطفا چند دقیقه دیگر مراجعه نمایید...",
    'select_one_to_show_detail' => "🔅 یکی از سرویس ها را انتخاب نمایید تا مشخصات کاملش را مشاهده کنید:",
    'you_dont_have_config' => "🙁 عزیزم، هنوز هیچ سفارشی نداری. باید یک کانفیگ خریداری کنی!",
    'no_order_found' => "⚠️ موردی یافت نشد.",
    'config_details_message' => "🔮 وضعیت کانفیگ: STATE
    
🔮 نام کانفیگ: NAME

🔗 لینک اتصال: CONNECT-LINK

🔗 لینک سابسکریپشن: SUB-LINK
",

    'please_wait_message' => "⏳ لطفاً منتظر بمانید...",
    'send_only_number' => "لطفا فقط عدد ارسال بکنید ❗️",
    'change_bot_settings_message' => "🔰 اگر برخی از امکانات ربات برای شما مورد استفاده نیست، می‌توانید آن‌ها را غیرفعال کنید.",
    'saved_successfuly' => "✅ با موفقیت ذخیره شد.",
    'invited_user_joined_message' => "😍 تبریک! یک کاربر جدید از طریق لینک شما وارد ربات شد.",
    'please_select_from_below_buttons' => "🔘 لطفاً فقط از دکمه‌های زیر استفاده کنید.",
    'use_iranian_number_only' => "🔘 لطفاً فقط از شماره‌های ایرانی استفاده کنید.",
    'phone_confirmed' => "✅ شماره شما با موفقیت تأیید شد.",
    'send_your_phone_number' => "سلام عزیز! برای استفاده از ربات، لطفاً شماره تماس خود را از طریق دکمه زیر ارسال کنید 👇",
    'start_message' => "سلام و خوش آمدید به ربات فروش ما! برای خرید و پشتیبانی از دکمه‌های زیر استفاده کنید:

✅ بالاترین کیفیت
📡 ارتباطی ایمن و پایدار
☎️ پشتیبانی 24 ساعته",

    'new_member_joined' => "📢 یک کاربر جدید به ربات پیوست:

👤 نام: FULLNAME
🔖 نام کاربری: @USERNAME
🔢 آیدی عددی: USERID

شاید بخوای براش یک پیام خوش‌آمدگویی یا تبلیغی بفرستی! 😍",

    "not_joine_yet" => "هنوز در کانال عضو نشده‌اید.",
    'insert_discount_code' => "🎁 لطفاً کد تخفیف خود را وارد کنید:",
    "not_valid_discount_code" => "😔 کد تخفیف وارد شده معتبر نیست.",
    'valid_discount_code' => "✅ کد تخفیف با موفقیت اعمال شد. مبلغ تخفیف: AMOUNT تومان",
	
    'used_discount_code' => "☑️ کد تخفیف استفاده شد:

🔰 آیدی کاربر: USERID
👤 نام کاربر: NAME
⚡️ نام کاربری: @USERNAME
🎁 کد تخفیف: DISCOUNTCODE
💰 مبلغ تخفیف: AMOUNT تومان",

    "send_config_uuid" => "❗️ لطفاً لینک کانفیگ یا UUID را ارسال کنید تا اطلاعات کامل را به شما بدهم. ❗️",
    'not_correct_text' => "متن وارد شده معتبر نیست.",
    'receving_information' => "♻️ در حال دریافت اطلاعات...",
    'request_agency_message' => "درخواست نمایندگی

🔰 آیدی کاربر: USERID
👤 نام کاربر: NAME
⚡️ نام کاربری: @USERNAME",

    'agency_request_sent' => "درخواست شما با موفقیت ارسال شد، لطفاً منتظر بمانید!",
    'agency_request_already_sent' => "درخواست شما قبلاً ارسال شده است، لطفاً منتظر بمانید.",
    'agency_request_declined' => "🥺 درخواست شما برای نمایندگی رد شد.",
    'agency_request_approved' => "✅ درخواست شما برای نمایندگی تأیید شد.",
    'send_agent_discount_percent' => "لطفاً درصد تخفیف نمایندگی را وارد کنید، مثلاً 10.",
	'agent_setting_message' => "🧚🏻‍♀️ نماینده عزیز:

از این بخش می‌توانید خریدهای تکی و انبوه انجام دهید و همچنین کانفیگ‌های خریداری‌شده را مدیریت کنید.",
    'selling_is_off'=>"درحال حاضر فروش نداریم لطفا بعدا مراجعه کنید",
    'no_server_available'=>"متاسفانه هم اکنون سرور فعالی نداریم، لطفا بعدا مراجعه کنید | ",
    'buy_sub_select_location' => "1️⃣ مرحله اول:

لطفاً لوکیشن مورد نظرت را برای خرید انتخاب کن 😊",
    'the_bot_in_not_admin' => "ظاهرا ربات هنوز عضوکانال یا ادمین نیست، اول ربات را عضو کانال کنید و سپس آی دی کانال را ارسال کنید...",
    'category_not_avilable' => "متأسفانه، هیچ دسته‌بندی برای این سرور موجود نیست.",
    'receive_categories' => "♻️ در حال دریافت دسته‌بندی‌ها...",
    'buy_sub_select_category'=> "2️⃣ مرحله دوم:

دسته بندی مورد نظرت رو انتخاب کن 🤭",
    'no_plan_available' => "💡 پلنی در این دسته‌بندی موجود نیست.",
    'receive_plans' => "📍 در حال دریافت لیست پلن‌ها...",
    'buy_sub_select_plan' => "3️⃣ مرحله سوم:

لطفا یکی از دسته بندی هارا انتخاب و آماده پرداخت شوید 💲",
 
    'buy_custom_plan' => "➕ پلن دلخواه خودت رو بخر.",
    'select_one_plan_to_edit' => "یکی از پلن‌ها رو انتخاب کن تا برات ویرایشش کنم.",
    'enter_account_amount' => "♻️ تعداد اکانت درخواستی را وارد کن (حداکثر هر بار 6 عدد):

⚠️ نکته: اگر تعداد بالا وارد کنی ممکنه ساخت اکانت با مشکل مواجه بشه و پنل x-ui گیر کنه.",

    'send_positive_number'=>"لطفا عددی بزرگتر از 0 وارد کنید",
    'buy_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        ➖➖➖➖➖➖➖
        💎 قیمت پنل : PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_much_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        تعداد اکانت: ACCOUNT-COUNT
        قیمت پنل: PRICE
        ➖➖➖➖➖➖➖
        💎 قیمت کل : TOTAL-PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_custom_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        حجم اختصاصی: VOLUME GB
        مدت اختصاصی: DAYS روز
        ➖➖➖➖➖➖➖
        💎 قیمت پنل : PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",

  'agents_list' => "🔍 لیست نمایندگان:

برای مشاهده آمار فروش هر نماینده، روی نام او کلیک کنید. همچنین می‌توانید درصد کمیسیون تعیین کنید یا نماینده را از لیست حذف نمایید.",

    'agent_deleted_successfuly' => "نماینده با موفقیت از لیست حذف شد.",
    'agent_details' => "🙎‍♂️ جزئیات نماینده AGENT-NAME:

در سمت راست، درآمد و در سمت چپ تعداد خریدهای نماینده نمایش داده شده است.",
    'send_config_remark'=>"لطفا ریمارک کانفیگ را وارد کنید",
    'forward_your_message' => "لطفاً پیام مورد نظر خود را به ربات فروارد کنید.",
    'enter_ticket_title' => "💠 لطفاً عنوان تیکت خود را ارسال نمایید.",
    "enter_ticket_description"=> "💠لطفا متن و یا عکس تیکت را بصورت ساده و مختصر ارسال کنید!",
    'sent_config_to_user' => "✅ کانفیگ با موفقیت ارسال شد:
        - توضیحات ( ریمارک ): REMARK
        - حجم سرویس: VOLUME گیگابایت
        - مدت زمان: DAYS روز",
    'renewed_config_to_user' => "✅ کانفیگ با موفقیت تمدید شد:
        - توضیحات ( ریمارک ): REMARK
        - حجم سرویس: VOLUME گیگابایت
        - مدت زمان: DAYS روز",
    'sending_config_to_user'=>'🚀 | 😍 در حال ارسال کانفیگ به مشتری ...',
    'config_not_found'=>"مشکلی پیش اومده، دوباره از نو انجام بده",
    'incorrect_config_name' => "نام وارد شده معتبر نیست. لطفاً یک نام کاربری معتبر با حروف کوچک و اعداد بدون فاصله به زبان انگلیسی وارد کنید.
    مثال اشتباه: Ali 123
    مثال صحیح: ali123",
    'pay_with_tron_wallet' => "♻️ لطفاً مبلغ AMOUNT ترون را به آدرس زیر ارسال کنید و تکس آیدی واریز را برای ما ارسال نمایید:

🔰 <code>TRON-WALLET</code>",
    'incorrect_tax_id' => "تکس آیدی وارد شده معتبر نیست.",
    'used_tax_id' => "این تکس آیدی قبلاً استفاده شده است.",
    'in_review_tax_id' => "تراکنش شما در صف بررسی قرار دارد.",
    'user_taxid_rejected' => "تراکنش ناموفق TYPE (ترون)

    - آیدی کاربر: USERID
    - نام: NAME
    - نام کاربری: USERNAME

    تکس آیدی: TAXID

    <b>بعد از 5 تلاش ناموفق، تراکنش رد شد</b>",
    'your_taxid_rejected' => "تراکنش TYPE شما با تکس آیدی: TAXID

    <b>بعد از 5 تلاش رد شد</b>",
    'incorrect_user_taxid_rejected' => "تراکنش ناموفق TYPE (ترون)

    - آیدی کاربر: USERID
    - نام: NAME
    - نام کاربری: USERNAME

    تکس آیدی: TAXID

    <b>به دلیل ثبت تراکنش نادرست رد شد</b>",
    'your_incorrect_taxid_rejected' => "تراکنش TYPE شما با تکس آیدی: TAXID

    <b>به دلیل ثبت تراکنش نادرست رد شد</b>",
    'partially_paid_user_taxid' => "تراکنش ناموفق TYPE (ترون)

    - آیدی کاربر: USERID
    - نام: NAME
    - نام کاربری: USERNAME

    تکس آیدی: TAXID

    <b>به دلیل عدم مطابقت مبلغ تراکنش رد شد</b>",
	
    'you_have_partially_paid' => "تراکنش TYPE شما با تکس آیدی: TAXID

<b>به دلیل عدم تطابق مبلغ تراکنش رد شد</b>",
    
    'agent_discount_settings' => "مدیریت تخفیف‌های نماینده AGENT-NAME",
    
    'config_doesnt_exist' => "کانفیگ مورد نظر یافت نشد."
];

$buttonValues = [
    'bot_reports' => "📉 گزارش کلی ربات",
    'message_to_user' => "📞 ارسال پیام خصوصی",
    'user_reports' => "🔑 اطلاعات کاربر",
    'admins_list' => "👤 لیست مدیران",
    'increase_wallet' => "💵 افزایش موجودی",
    'decrease_wallet' => "💸 کاهش موجودی",
    'create_account' => "⌨️ ایجاد اکانت انبوه",
    'ban_user' => "❌ مسدود کردن کاربر",
    'unban_user' => "✅ آزاد کردن کاربر",
    'server_settings' => "🚦 مدیریت و تنظیمات سرورها",
    'categories_settings' => "🗂 مدیریت دسته‌بندی‌ها",
    'plan_settings' => "🪣 مدیریت پلن‌ها",
    'discount_settings' => "🎁 مدیریت تخفیف‌ها",
    'main_button_settings' => "🕹 مدیریت دکمه‌ها",
    'gateways_settings' => "💳 تنظیمات درگاه‌ها و کانال‌ها",
    'bot_settings' => "⚙️ تنظیمات ربات",
    'tickets_list' => "📪 لیست تیکت‌ها",
    'message_to_all' => "📨 ارسال پیام همگانی",
    'forward_to_all' => "📨 فوروارد پیام همگانی",
    'back_to_main' => "⤵️ بازگشت به منوی اصلی",
    'cart_to_cart' => "💳 انتقال وجه کارت به کارت",
    'now_payment_gateway' => "💳 درگاه NowPayment",
    'zarinpal_gateway' => "💳 درگاه زرین پال",
    'nextpay_gateway' => "💳 درگاه نکست پی",
    'weswap_gateway' => "💳 درگاه ارزی ریالی",
    'approve' => 'تأیید ✅',
    'approved' => 'تأیید شد',
    'decline' => 'عدم تأیید ❌',
    'declined' => 'رد شد',
    'back_button' => "🔙 بازگشت",
    'renew_connection_link' => "🚷 قطع دسترسی و ایجاد لینک جدید",
    'update_config_connection' => "⌛️ به‌روزرسانی کانفیگ",
    'increase_config_volume' => "🩸 افزایش حجم سرویس",
    'increase_config_days' => "📆 افزایش زمان سرویس",
    'renew_config' => "♻ تمدید سرویس",
    'change_config_location' => "🌎 تغییر موقعیت مکانی",
    'selected_protocol' => "🚦 پروتکل انتخابی",
    'volume_left' => "⏳ حجم باقی‌مانده:",
    'expire_date' => "⏰ تاریخ انقضاء:",
    'buy_date' => "⏰ تاریخ خرید:",
    'plan_name' => "🚀 نام پلن:",
    'on' => "روشن ✅",
    'off' => "خاموش ❌",
    'active' => "فعال 🟢",
    'deactive' => "غیرفعال 🔴",
    'send_phone_number' => "☎️ ارسال شماره تماس",
    'send_message_to_user' => "✉️ ارسال پیام به کاربر",
    'cancel' => "😪 منصرف شدم",
    'join_channel' => "عضویت در کانال",
    'have_joined' => "عضو شدم ✅",
    'gift_volume_day' => "🎯 هدیه حجم و زمان",
    'test_account' => "🎁 دریافت اکانت تست",
    'invite_friends' => "🏆 دعوت دوستان",
    'my_info' => "🧑‍💼 اطلاعات حساب کاربری",
    'my_subscriptions' => "📱 کانفیگ‌های من",
    'buy_subscriptions' => "🛒 خرید کانفیگ جدید",
    'shared_existence' => "❕ موجودی اشتراکی",
    'individual_existence' => "❗️ موجودی اختصاصی",
    'application_links' => "🧩 راهنمای اتصال",
    'my_tickets' => "📨 تیکت‌های من",
    'search_config' => "🪫 جستجوی کانفیگ",
    'delete_config' => "❌ حذف کانفیگ",
    'pay_with_wallet' => "💰 پرداخت با موجودی",
    'request_agency' => "🧑‍💼 درخواست نمایندگی",
    'agency_setting' => "➰ پنل همکاری",
    'agent_one_buy' => "➕ خرید تکی",
    'agent_much_buy' => "♾ خرید انبوه",
    'agent_bought_accounts' => "تعداد خریدها",
    'agent_joined_date' => "تاریخ عضویت",
    'agent_agency_date' => "تاریخ نمایندگی",
    'agent_list' => "📍 مدیریت نمایندگان",
    'search_agent_config' => "جستجوی کانفیگ نماینده",
    'search_admin_config' => "جستجوی کانفیگ کاربر",
    'sharj' => "✅ 💳 ارسال رسید - شارژ کیف پول",
    'qr_config' => "🔳 کد QR کانفیگ",
    'qr_sub' => "🔳 کد QR اشتراک",
    'start_bot' => "شروع ربات",
    'enable_config' => "فعال‌سازی کانفیگ",
    'disable_config' => "غیرفعال‌سازی کانفیگ",
    'tron_gateway' => "درگاه ترون",
    'plan_discount' => "تخفیف روی پلن",
    'server_discount' => "تخفیف روی سرور"
];
?>
